{
	"extensionDescription": {
		"message": "Removes or hides elements from html document. Use config to define queries to remove elements by it's CSS-selector.",
		"description": "Extension description"
	},
	"extensionName": {
		"message": "HTML-element remover",
		"description": "Extension name"
	},
	"configDescription": {
		"message": "<p>When the extension is installed it needs to be configured. At the moment the configuration is written as JSON in a textarea.</p> <p>Configuring the extension can be tricky. It will not work if the JSON data is not valid. This is an area of improvement.</p> <p><strong>Explanation</strong></p> <ul> <li>The option <code>undo = boolean</code> (optional) = undo menu-item will be visible if set totrue </li> <li>The <code>items = array</code> will be shown in a context menu when right clicking on the document body.<ul> <li>Each <code>item</code> can perform different tasks.</li> <li>The <code>name = string</code> will be displayed as the context menu item.</li> <li>The <code>query = array</code> is the defined task to perform on the document body. Multiple queries can be configured on each item.</li> <li><code>delete = boolean</code> (optional) - if set totrue the matched element will be completely deleted from the document (can't be undone), otherwise it will be hidden or removed via CSS</li> <li><code>remove = boolean</code> (optional) - if set totrue the matched element will be removed from the document, otherwise it will be hidden via CSS</li> <li><code>preview = boolean</code> (optional) - if set totrue the matched element will be left in the document with a dashed outline. Use this to preview what will be changed</li> <li><code>action = string</code> - what to do after performed action <code>(print|savePDF)</code></li> <li><code>selector = string</code> - the CSS selector to match</li> <li><code>innerText = string</code> - only match if the selected element has this inner text</li> <li><code>innerHTML = string</code> - only match if the selected element has this inner HTML</li> </ul> </li> </ul>",
		"description": "Text on options page"
	},
	"configTitle": {
		"message": "<h1>Setup</h1>",
		"description": "Options header"
	}
}